
"Quarterly" = "Sabbatschule an einem ort";

"Lesson" = "Wöchentliche Lektionen";

"Reading" = "Lesen & studieren Sabbatschule";

"Verse" = "Bibelverse zur hand";

"Theme" = "Kundengerechtes leseerlebnis";
